Tekla Open API Reference for Tekla Structures 2025
Events.ViewCameraChanged Event
 Occurs when view camera is changed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ViewCameraChangedDelegate ViewCameraChanged
Public Event ViewCameraChanged As Events.ViewCameraChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ViewCameraChangedDelegate
Implements
IEvents.ViewCameraChanged
See Also
Reference
Events Class
Tekla.Structures.Model Namespace